src/InformationRegisters/кфкПозицииОпераций/кфкПозицииОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПозицииОпераций</name>
  <resources>
    <name>КомбинированнаяМетка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РазделПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкПозицииОпераций/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получить позицию.
// 
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор операции
//  Раздел - Строка - Дополнительный раздел операции
// 
// Возвращаемое значение:
//  Число - Полная комбинированная метка
Функция ПолучитьПозицию(Идентификатор, Раздел = "") Экспорт
	
	// Получаем сохранённую позицию операции и раздела.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Запрос.Текст = "ВЫБРАТЬ
	|    Т.КомбинированнаяМетка КАК КомбинированнаяМетка
	|ИЗ
	|    РегистрСведений.кфкПозицииОпераций КАК Т
	|ГДЕ
	|    Т.Идентификатор = &Идентификатор
	|    И Т.Раздел = &Раздел";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка[0], 0);
	
КонецФункции

// Обновить позиции.
// 
// Параметры:
//	Идентификатор - УникальныйИдентификатор - Идентификатор операции
//	КомбинированнаяМетка - Число - Полная комбинированная метка
//	Раздел - Неопределено - Дополнительный раздел операции не задан.
//	       - Структура:
//		* Значение - Строка - Идентификатор раздела
//		* Представление - Строка - Представление раздела
Процедура ОбновитьПозицию(Идентификатор, КомбинированнаяМетка, Раздел = Неопределено) Экспорт
	
	Набор = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(
		РегистрыСведений.кфкПозицииОпераций); // РегистрСведенийНаборЗаписей.кфкПозицииОпераций
	
	Набор.Отбор.Идентификатор.Установить(Идентификатор);
	Набор.Отбор.Раздел.Установить(?(Раздел = Неопределено, "", Раздел.Значение));
	
	НоваяСтрока = Набор.Добавить();
	НоваяСтрока.Идентификатор = Идентификатор;
	НоваяСтрока.КомбинированнаяМетка = КомбинированнаяМетка;
	
	Если Раздел <> Неопределено Тогда
		НоваяСтрока.Раздел = Раздел.Значение;
		НоваяСтрока.РазделПредставление = Раздел.Представление;
	КонецЕсли;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
